{
  "auto_mapping": null,
  "base_model_name_or_path": "EleutherAI/pythia-1b-deduped",
  "inference_mode": true,
  "num_attention_heads": 8,
  "num_layers": 16,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 8,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Classify if the tweet is a complaint or not:",
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 2048,
  "tokenizer_name_or_path": "EleutherAI/pythia-1b-deduped"
}